---
kind: property
id: P:Autodesk.Revit.DB.NumberSystem.PlacementLevelId
source: html/fe0c22de-11c5-3436-e981-6703e45610c1.htm
---
# Autodesk.Revit.DB.NumberSystem.PlacementLevelId Property

The id of the base level of stairs on which the NumberSystem is placed.

## Syntax (C#)
```csharp
public LinkElementId PlacementLevelId { get; }
```

## Remarks
In multistory stairs, a stairs element could be a stair group or individual stair, this level could be the base level of group member or stairs element.